common/sequence/DC_API_flow.mmd
sequenceDiagram
    autonumber
    actor User
    participant Wallet Unit as Wallet Unit
    participant OS/Browser as OS/Browser
    participant RP App as RP App
    participant RP BE as RP BE
    participant Issuer

    activate User
    User->>RP App: Pay for order with EUDIW
    activate RP App
    RP App->>OS/Browser: User Agent Allows Protocol Request
    activate OS/Browser
    OS/Browser-->>RP App: User Agent Allows Protocol Response
    deactivate OS/Browser
    Note right of RP App: In case User Agent does not support DC API<br/>i.e. Firefox or Linux OS solution should<br/>fallback on QR code or deeplink navigation.<br/>See diagram for deeplink in integration

    RP App->>RP BE: Prepare Openid4VP Request with Payment
    activate RP BE
    RP BE-->>RP App: Signed Openid4VP Request
    deactivate RP BE
    RP App->>OS/Browser: DC API Openid4VP request
    
    %% Payment Authorization
    deactivate RP App
    activate OS/Browser
    Note left of OS/Browser: here is simplification,<br/>user may choose "Wallet Unit" with credential,<br/>which they will use,<br/>in case of A.1 it should be generic SUA attestation<br/>in case of A.2 it should be IBAN as SUA attestation<br/>in case of B.1 it should be generic SUA attestation<br/>in case of B.2 it should be Card attestation as SUA attestation

    OS/Browser->>Wallet Unit: Invoke with Openid4VP request
    deactivate OS/Browser
    
    Note left of Wallet Unit: We have gap that merchant will have to<br/>send transaction_data<br/>in DC API Credential Request in open form<br/>and therefore it is available of platform to inspect.<br/>This is most likely privacy issue that needs to be addressed in protocols.

    activate Wallet Unit
    Wallet Unit->>Wallet Unit: Validate DC API Credential request
    
    opt vct metadata cache empty
        loop vct in payment credentials
            Wallet Unit->>Issuer: Get SD-JWT vct metadata
            activate Issuer
            Issuer-->>Wallet Unit: vct metadata
            deactivate Issuer
        end
        Wallet Unit->>Wallet Unit: Evalute credential eligibility for payment type
    end
    
    Wallet Unit->>Wallet Unit: Display Payment
    User->>Wallet Unit: Confirm Payment & authenticate for SUA key
    Wallet Unit->>Wallet Unit: Attach transaction data KB-JWT to SUA presentation, create final VP token
    Wallet Unit->>Wallet Unit: Encrypt with Merchant public key
    Wallet Unit-->>OS/Browser: encrypted response
    deactivate Wallet Unit
    
    activate OS/Browser
    OS/Browser-->>RP App: DC API credential response
    deactivate OS/Browser
    activate RP App

    RP App->>RP BE: POST /response with encrypted vptoken
    Note left of RP BE: Not standardised, depends on merchant integration patterns
    activate RP BE
    RP BE->>RP BE: decrypt and validate vptoken
    RP BE-->>RP App: response OK/NOK
    deactivate RP BE
    deactivate RP App
    deactivate User
